import { Question } from "types/question";

export const questions: Record<string, Question> = {
  "1": {
    text: "Какой ваш любимый цвет?",
    answers: ["Красный", { Синий: "1.1" }, { Зеленый: "1.2" }, "Желтый"],
  },
  "1.1": {
    text: "Какой оттенок синего вам по душе?",
    answers: [
      "Небесно-голубой",
      "Голубой",
      "Бирюзовый",
      "Аквамариновый",
      "Лазурный",
      "Ледяной синий",
    ],
  },
  "1.2": {
    text: "Какой оттенок зеленого вам по душе?",
    answers: ["Салатовый", "Изумрудный"],
  },
  "2": {
    text: "Какую работу вы предпочитаете?",
    answers: ["Офисную", "Удаленную", "Физическую", "Творческую"],
  },
};
